import re

years = ["2021", "2020", "2019", "2018", "2017"]

# key: 課程, value: 学部・研究科
majors = {
    "1": [
        "11001",
        "11002",
        "11003",
        "11004",
        "11005",
        "11007",
        "11008",
        "11009",
        "11014",
        "11015",
        "11016",
        "11017",
        "11019",
        "11020",
        "11022",
        "11060",
        "11061",
        "11065",
        "11090",
    ],
    "3": [
        "33001",
        "33002",
        "33003",
        "33004",
        "33005",
        "33007",
        "33008",
        "33009",
        "33013",
        "33014",
        "33015",
        "33016",
        "33017",
        "33018",
        "33056",
        "33562",
        "33563",
    ],
    "5": [
        "55007",
        "55021"
    ],
    "6": [
        "66012",
        "66013"
    ],
    "9": [
        "99090",
        "99091"
    ]
}
TOP_PAGE_URL = "https://duet.doshisha.ac.jp/kokai/html/fi/fi020/FI02001G.html"
PATTERN = re.compile(r'\n *')

degree_map = {
    "1": "学部科目",
    "3": "大学院科目",
    "5": "一貫制大学院科目",
    "6": "専門職大学院科目",
    "9": "その他科目",
}

major_map = {
    "11001": "神学部",
    "11002": "文学部",
    "11003": "法学部",
    "11004": "経済学部",
    "11005": "商学部",
    "11007": "政策学部",
    "11008": "文化情報学部",
    "11009": "社会学部",
    "11014": "生命医科学部",
    "11015": "スポーツ健康科学部",
    "11016": "理工学部",
    "11017": "心理学部",
    "11019": "グローバル・コミュニケーション学部",
    "11020": "国際教育インスティチュート",
    "11022": "グローバル地域文化学部",
    "11060": "全学共通教養教育科目（外国語教育科目・保健体育科目以外）",
    "11061": "全学共通教養教育科目（保健体育科目）",
    "11065": "全学共通教養教育科目（外国語教育科目）",
    "11090": "日本語・日本文化教育科目",
    "33001": "神学研究科",
    "33002": "文学研究科",
    "33003": "法学研究科",
    "33004": "経済学研究科",
    "33005": "商学研究科",
    "33007": "総合政策科学研究科",
    "33008": "文化情報学研究科",
    "33009": "社会学研究科",
    "33013": "ビジネス研究科",
    "33014": "生命医科学研究科",
    "33015": "スポーツ健康科学研究科",
    "33016": "理工学研究科",
    "33017": "心理学研究科",
    "33018": "グローバル・スタディーズ研究科",
    "33056": "GRM科目",
    "33562": "Comm5.0-AI・DS科目",
    "33563": "ＡＬＡ科目",
    "55007": "総合政策科学研究科",
    "55021": "脳科学研究科",
    "66012": "司法研究科",
    "66013": "ビジネス研究科",
    "99090": "日本語・日本文化教育科目",
    "99091": "グローバル教育科目",
}
